Revit 2024 API
BuiltInFailures.FamilyFailures.UnableToUpgradeDueToCorruptFamilies Property
 Some families have become unusable. Reload the families, or delete them from the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToUpgradeDueToCorruptFamilies { get; }
Visual Basic
Public Shared ReadOnly Property UnableToUpgradeDueToCorruptFamilies As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToUpgradeDueToCorruptFamilies {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace